# Прізвище: Ткаченко
# Iм’я: Данііл
# Номер групи: ІН-22
# Коментар: Я використав три вбудовані функції Python для обробки рядків: split(), capitalize() та count().

text = "Народження байки сягає глибини тисячоліть. Люди любили слухати й розповідати історії про добрих або злих, розумних або дурних, хитрих або простакуватих тварин. Ці оповідки могли бути довгими або коротенькими. Усе залежало від мети й натхнення оповідача, а також настрою слухачів. Коли не треба було поспішати і всі були в доброму гуморі, то розповіді тривали годинами. Якщо виникала потреба у швидкій дотепній відповіді, то оповідка ставала дуже короткою.Свідченням прадавнього походження байок є малюнки первісних людей, де зображені звірі. Про це свідчать знахідки археологів під час розкопок Вавилона, де на знайдених цеглинках відтворені сцени з відомих міфів і казок про тварин ."

# Розділяємо текст на окремі слова
words = text.split()

# Перетворюємо перший символ кожного слова на велику літеру
capitalized_words = [word.capitalize() for word in words]

# Виводимо результат
print("Текст з кожним словом, починаючи з великої літери:")
print(" ".join(capitalized_words))

# Рахуємо кількість входжень слова "в" у тексті
count_of_word = text.count("в")
print(f"Кількість входжень слова 'в' у тексті: {count_of_word}")
